app/controllers/students_controller.rb

    def index
        @students = Student.all.map {|student| student.first_name}
---
SELECT "students".* FROM "students"